//IANFT024 JOB (KRUNGSRI),'FTP-ANYID           ',CLASS=4,
//         MSGLEVEL=(1,1),MSGCLASS=Y,TIME=0030,REGION=300M
//*
//* --------------------------------------------------------------------
//* 1) PUT FILE TO SPC SERVER
//*    BPR_507_BAY_YYMMDD
//* --------------------------------------------------------------------
//*
//PUTFILE  EXEC PGM=DMBATCH,PARM=(YYSLYNN)
//STEPLIB  DD DSN=CONNECT.LINKLIB,DISP=SHR
//DMPUBLIB DD DSN=PBAY.CONNECT.PROCESS,DISP=SHR
//         DD DSN=CONNECT.PROCESS,DISP=SHR
//DMNETMAP DD DSN=CONNECT.NETMAP,DISP=SHR
//DMMSGFIL DD DSN=CONNECT.MSG,DISP=SHR
//DMPRINT  DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSIN    DD DISP=SHR,DSN=PBAY.ANY.DBAT2.SAMF.BPR507.CD.D%NYMDT0D
//*
