//IATFT003 JOB (KRUNGSRI),'GET FILE AJF        ',CLASS=4,               00030000
//         MSGLEVEL=(1,1),MSGCLASS=Y,TIME=1440,REGION=500M              00031000
//*                                                                     00031700
//DELDSN   EXEC PGM=IEFBR14,COND=(0,NE)
//DD0      DD DSN=PPTF.CD.IATFT003.D%NYMDP5W,
//         DISP=(MOD,DELETE,DELETE),
//         UNIT=SYSDA,SPACE=(TRK,0)
//         DD DSN=PPTF.CD.IATFT003.D%NYMDT0D,
//         DISP=(MOD,DELETE,DELETE),
//         UNIT=SYSDA,SPACE=(TRK,0)
//DD1      DD DSN=PPTF.PAUT1.AJF.AJF.D001AJF.D%NYMDP5W..H,
//         DISP=(MOD,DELETE,DELETE),
//         UNIT=SYSDA,SPACE=(TRK,0)
//         DD DSN=PPTF.PAUT1.AJF.AJF.D001AJF.D%NYMDT0D..H,
//         DISP=(MOD,DELETE,DELETE),
//         UNIT=SYSDA,SPACE=(TRK,0)
//DD2      DD DSN=PPTF.PAUT2.AJF.AJF.D002AJF.D%NYMDP5W..H,
//         DISP=(MOD,DELETE,DELETE),
//         UNIT=SYSDA,SPACE=(TRK,0)
//         DD DSN=PPTF.PAUT2.AJF.AJF.D002AJF.D%NYMDT0D..H,
//         DISP=(MOD,DELETE,DELETE),
//         UNIT=SYSDA,SPACE=(TRK,0)
//DD3      DD DSN=PPTF.PAUT3.AJF.AJF.D003AJF.D%NYMDP5W..H,
//         DISP=(MOD,DELETE,DELETE),
//         UNIT=SYSDA,SPACE=(TRK,0)
//         DD DSN=PPTF.PAUT3.AJF.AJF.D003AJF.D%NYMDT0D..H,
//         DISP=(MOD,DELETE,DELETE),
//         UNIT=SYSDA,SPACE=(TRK,0)
//DD4      DD DSN=PPTF.PAUT4.AJF.AJF.D006AJF.D%NYMDP5W..H,
//         DISP=(MOD,DELETE,DELETE),
//         UNIT=SYSDA,SPACE=(TRK,0)
//         DD DSN=PPTF.PAUT4.AJF.AJF.D006AJF.D%NYMDT0D..H,
//         DISP=(MOD,DELETE,DELETE),
//         UNIT=SYSDA,SPACE=(TRK,0)
//DD5      DD DSN=PPTF.PAUT5.AJF.AJF.D007AJF.D%NYMDP5W..H,
//         DISP=(MOD,DELETE,DELETE),
//         UNIT=SYSDA,SPACE=(TRK,0)
//         DD DSN=PPTF.PAUT5.AJF.AJF.D007AJF.D%NYMDT0D..H,
//         DISP=(MOD,DELETE,DELETE),
//         UNIT=SYSDA,SPACE=(TRK,0)
//DD6      DD DSN=PPTF.PAUT6.AJF.AJF.D013AJF.D%NYMDP5W..H,
//         DISP=(MOD,DELETE,DELETE),
//         UNIT=SYSDA,SPACE=(TRK,0)
//         DD DSN=PPTF.PAUT6.AJF.AJF.D013AJF.D%NYMDT0D..H,
//         DISP=(MOD,DELETE,DELETE),
//         UNIT=SYSDA,SPACE=(TRK,0)
//DD7      DD DSN=PPTF.PAUT7.AJF.AJF.D014AJF.D%NYMDP5W..H,
//         DISP=(MOD,DELETE,DELETE),
//         UNIT=SYSDA,SPACE=(TRK,0)
//         DD DSN=PPTF.PAUT7.AJF.AJF.D014AJF.D%NYMDT0D..H,
//         DISP=(MOD,DELETE,DELETE),
//         UNIT=SYSDA,SPACE=(TRK,0)
//DD8      DD DSN=PPTF.PAUTA.AJF.AJF.D016AJF.D%NYMDP5W..H,
//         DISP=(MOD,DELETE,DELETE),
//         UNIT=SYSDA,SPACE=(TRK,0)
//         DD DSN=PPTF.PAUTA.AJF.AJF.D016AJF.D%NYMDT0D..H,
//         DISP=(MOD,DELETE,DELETE),
//         UNIT=SYSDA,SPACE=(TRK,0)
//DD9      DD DSN=PPTF.PAUTB.AJF.AJF.D023AJF.D%NYMDP5W..H,
//         DISP=(MOD,DELETE,DELETE),
//         UNIT=SYSDA,SPACE=(TRK,0)
//         DD DSN=PPTF.PAUTB.AJF.AJF.D023AJF.D%NYMDT0D..H,
//         DISP=(MOD,DELETE,DELETE),
//         UNIT=SYSDA,SPACE=(TRK,0)
//DD10     DD DSN=PPTF.PAUTC.AJF.AJF.D101AJF.D%NYMDP5W..H,
//         DISP=(MOD,DELETE,DELETE),
//         UNIT=SYSDA,SPACE=(TRK,0)
//         DD DSN=PPTF.PAUTC.AJF.AJF.D101AJF.D%NYMDT0D..H,
//         DISP=(MOD,DELETE,DELETE),
//         UNIT=SYSDA,SPACE=(TRK,0)
//DD11     DD DSN=PPTF.PAUT9.AJF.AJF.D211AJF.D%NYMDP5W..H,
//         DISP=(MOD,DELETE,DELETE),
//         UNIT=SYSDA,SPACE=(TRK,0)
//         DD DSN=PPTF.PAUT9.AJF.AJF.D211AJF.D%NYMDT0D..H,
//         DISP=(MOD,DELETE,DELETE),
//         UNIT=SYSDA,SPACE=(TRK,0)
//*
//DEFINE   EXEC PGM=IDCAMS,COND=(0,NE)
//SYSPRINT  DD  SYSOUT=*
//INPUT1   DD DUMMY
//OUTPU1   DD DISP=(,CATLG),
//    DSN=PPTF.PAUT1.AJF.AJF.D001AJF.D%NYMDT0D..H,
//    DCB=(RECFM=FB,LRECL=800,DSORG=PS,BLKSIZE=0),
//    UNIT=SYSDA,
//    SPACE=(CYL,(2,2))
//OUTPU2   DD DISP=(,CATLG),
//    DSN=PPTF.PAUT2.AJF.AJF.D002AJF.D%NYMDT0D..H,
//    DCB=(RECFM=FB,LRECL=1024,DSORG=PS,BLKSIZE=0),
//    UNIT=SYSDA,
//    SPACE=(CYL,(1,1))
//OUTPU3   DD DISP=(,CATLG),
//    DSN=PPTF.PAUT3.AJF.AJF.D003AJF.D%NYMDT0D..H,
//    DCB=(RECFM=FB,LRECL=60,DSORG=PS,BLKSIZE=0),
//    UNIT=SYSDA,
//    SPACE=(CYL,(50,50))
//OUTPU4   DD DISP=(,CATLG),
//    DSN=PPTF.PAUT4.AJF.AJF.D006AJF.D%NYMDT0D..H,
//    DCB=(RECFM=FB,LRECL=160,DSORG=PS,BLKSIZE=0),
//    UNIT=SYSDA,
//    SPACE=(CYL,(120,60))
//OUTPU5   DD DISP=(,CATLG),
//    DSN=PPTF.PAUT5.AJF.AJF.D007AJF.D%NYMDT0D..H,
//    DCB=(RECFM=FB,LRECL=39,DSORG=PS,BLKSIZE=0),
//    UNIT=SYSDA,
//    SPACE=(CYL,(1,1))
//OUTPU6   DD DISP=(,CATLG),
//    DSN=PPTF.PAUT6.AJF.AJF.D013AJF.D%NYMDT0D..H,
//    DCB=(RECFM=FB,LRECL=94,DSORG=PS,BLKSIZE=0),
//    UNIT=SYSDA,
//    SPACE=(CYL,(1,1))
//OUTPU7   DD DISP=(,CATLG),
//    DSN=PPTF.PAUT7.AJF.AJF.D014AJF.D%NYMDT0D..H,
//    DCB=(RECFM=FB,LRECL=200,DSORG=PS,BLKSIZE=0),
//    UNIT=SYSDA,
//    SPACE=(CYL,(1,1))
//OUTPU8   DD DISP=(,CATLG),
//    DSN=PPTF.PAUTA.AJF.AJF.D016AJF.D%NYMDT0D..H,
//    DCB=(RECFM=FB,LRECL=256,DSORG=PS,BLKSIZE=0),
//    UNIT=SYSDA,
//    SPACE=(CYL,(60,60))
//OUTPU9   DD DISP=(,CATLG),
//    DSN=PPTF.PAUTB.AJF.AJF.D023AJF.D%NYMDT0D..H,
//    DCB=(RECFM=FB,LRECL=128,DSORG=PS,BLKSIZE=0),
//    UNIT=SYSDA,
//    SPACE=(CYL,(1,1))
//OUTPU10  DD DISP=(,CATLG),
//    DSN=PPTF.PAUTC.AJF.AJF.D101AJF.D%NYMDT0D..H,
//    DCB=(RECFM=FB,LRECL=1536,DSORG=PS,BLKSIZE=0),
//    UNIT=SYSDA,
//    SPACE=(CYL,(5,2))
//OUTPU11  DD DISP=(,CATLG),
//    DSN=PPTF.PAUT9.AJF.AJF.D211AJF.D%NYMDT0D..H,
//    DCB=(RECFM=FB,LRECL=100,DSORG=PS,BLKSIZE=0),
//    UNIT=SYSDA,
//    SPACE=(CYL,(5,2))
//SYSIN     DD  *
     REPRO INFILE(INPUT1)    OUTFILE(OUTPU1)
     REPRO INFILE(INPUT1)    OUTFILE(OUTPU2)
     REPRO INFILE(INPUT1)    OUTFILE(OUTPU3)
     REPRO INFILE(INPUT1)    OUTFILE(OUTPU4)
     REPRO INFILE(INPUT1)    OUTFILE(OUTPU5)
     REPRO INFILE(INPUT1)    OUTFILE(OUTPU6)
     REPRO INFILE(INPUT1)    OUTFILE(OUTPU7)
     REPRO INFILE(INPUT1)    OUTFILE(OUTPU8)
     REPRO INFILE(INPUT1)    OUTFILE(OUTPU9)
     REPRO INFILE(INPUT1)    OUTFILE(OUTPU10)
     REPRO INFILE(INPUT1)    OUTFILE(OUTPU11)
//*
//GETFILE  EXEC PGM=DMBATCH,PARM=(YYSLYNN),COND=(0,NE)
//STEPLIB  DD DSN=CONNECT.LINKLIB,DISP=SHR
//DMPUBLIB DD DSN=PBAY.CONNECT.PROCESS,DISP=SHR
//         DD DSN=CONNECT.PROCESS,DISP=SHR
//DMNETMAP DD DSN=CONNECT.NETMAP,DISP=SHR
//DMMSGFIL DD DSN=CONNECT.MSG,DISP=SHR
//DMPRINT  DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSIN    DD *
 SIGNON  USERID=(CDSADMIN,DIRECT)
     SUBMIT PROC=SW2MF11  PNODE=BAY2                             -
                          SNODE=ORACLEFINANCE_G                  -
      &FR1='D:\Bay\krungsrifileserver\D001AJF.txt'               -
      &TO1=PPTF.PAUT1.AJF.AJF.D001AJF.D%NYMDT0D..H               -
      &FR2='D:\Bay\krungsrifileserver\D002AJF.txt'               -
      &TO2=PPTF.PAUT2.AJF.AJF.D002AJF.D%NYMDT0D..H               -
      &FR3='D:\Bay\krungsrifileserver\D003AJF.txt'               -
      &TO3=PPTF.PAUT3.AJF.AJF.D003AJF.D%NYMDT0D..H               -
      &FR4='D:\Bay\krungsrifileserver\D006AJF.txt'               -
      &TO4=PPTF.PAUT4.AJF.AJF.D006AJF.D%NYMDT0D..H               -
      &FR5='D:\Bay\krungsrifileserver\D007AJF.txt'               -
      &TO5=PPTF.PAUT5.AJF.AJF.D007AJF.D%NYMDT0D..H               -
      &FR6='D:\Bay\krungsrifileserver\D013AJF.txt'               -
      &TO6=PPTF.PAUT6.AJF.AJF.D013AJF.D%NYMDT0D..H               -
      &FR7='D:\Bay\krungsrifileserver\D014AJF.txt'               -
      &TO7=PPTF.PAUT7.AJF.AJF.D014AJF.D%NYMDT0D..H               -
      &FR8='D:\Bay\krungsrifileserver\D016AJF.txt'               -
      &TO8=PPTF.PAUTA.AJF.AJF.D016AJF.D%NYMDT0D..H               -
      &FR9='D:\Bay\krungsrifileserver\D023AJF.txt'               -
      &TO9=PPTF.PAUTB.AJF.AJF.D023AJF.D%NYMDT0D..H               -
      &FR10='D:\Bay\krungsrifileserver\D101AJF.txt'              -
      &TO10=PPTF.PAUTC.AJF.AJF.D101AJF.D%NYMDT0D..H              -
      &FR11='D:\Bay\krungsrifileserver\D211AJF.txt'              -
      &TO11=PPTF.PAUT9.AJF.AJF.D211AJF.D%NYMDT0D..H              -
      CASE=YES                                                   -
      CLASS=4                                                    -
      NEWNAME=IATFT003                                           -
      &JOBNM=IATFT003                                            -
      &SBLANKS=YES                                               -
      &TRIDSN=PPTF.CD.IATFT003.D%NYMDT0D
 SIGNOFF
//*
